Ran Apply for project: `apps` dir: `terragrunt-integration/terraform` workspace: `default`

**Apply Error**
<details><summary>Show Output</summary>

```
running 'sh -c' 'terragrunt run apply --all' in '/home/atlantis/.atlantis/repos/jefersonlemos/atlantis-playground/25/default/terragrunt-integration/terraform': exit status 1: running "terragrunt run apply --all" in "/home/atlantis/.atlantis/repos/jefersonlemos/atlantis-playground/25/default/terragrunt-integration/terraform": 
21:16:54.931 INFO   The runner at . will be processed in the following order for command apply:
Group 1
- Unit .
- Unit ./modules/random

Group 2
- Unit ./app1
- Unit ./app2


21:16:54.953 INFO   Downloading Terraform configurations from ./modules/random into ./.terragrunt-cache/AFhqy88-GgepsWaU7bktFuKYS98/ucpIR4vBHS23Mk_Z6sEJ2RKrzqY
21:16:54.975 INFO   tofu: Initializing the backend...
21:16:54.975 INFO   tofu: Initializing provider plugins...
21:16:54.975 INFO   tofu: - Reusing previous version of hashicorp/random from the dependency lock file
21:16:54.985 STDERR [modules/random] tofu: ╷
21:16:54.985 STDERR [modules/random] tofu: │ Error: Required plugins are not installed
21:16:54.986 STDERR [modules/random] tofu: │ 
21:16:54.986 STDERR [modules/random] tofu: │ The installed provider plugins are not consistent with the packages
21:16:54.986 STDERR [modules/random] tofu: │ selected in the dependency lock file:
21:16:54.986 STDERR [modules/random] tofu: │   - registry.opentofu.org/hashicorp/random: there is no package for registry.opentofu.org/hashicorp/random 3.7.2 cached in .terraform/providers
21:16:54.986 STDERR [modules/random] tofu: │ 
21:16:54.986 STDERR [modules/random] tofu: │ OpenTofu uses external plugins to integrate with a variety of different
21:16:54.986 STDERR [modules/random] tofu: │ infrastructure services. To download the plugins required for this
21:16:54.986 STDERR [modules/random] tofu: │ configuration, run:
21:16:54.986 STDERR [modules/random] tofu: │   tofu init
21:16:54.986 STDERR [modules/random] tofu: ╵
21:16:54.987 ERROR  [modules/random] tofu invocation failed in ./modules/random
21:16:54.987 ERROR  [modules/random] Unit ./modules/random has finished with an error
21:16:55.846 INFO   tofu: - Installing hashicorp/random v3.7.2...
21:16:56.633 INFO   tofu: - Installed hashicorp/random v3.7.2 (signed, key ID 0C0AF313E5FD9F80)
21:16:56.633 INFO   tofu: Providers are signed by their developers.
21:16:56.633 INFO   tofu: If you'd like to know more about provider signing, you can read about it here:
21:16:56.633 INFO   tofu: https://opentofu.org/docs/cli/plugins/signing/
21:16:56.633 INFO   tofu: OpenTofu has made some changes to the provider dependency selections recorded
21:16:56.633 INFO   tofu: in the .terraform.lock.hcl file. Review those changes and commit them to your
21:16:56.633 INFO   tofu: version control system if they represent changes you intended to make.
21:16:56.633 INFO   tofu: ╷
21:16:56.633 INFO   tofu: │ Warning: Dependency lock file entries automatically updated
21:16:56.633 INFO   tofu: │ 
21:16:56.633 INFO   tofu: │ OpenTofu automatically rewrote some entries in your dependency lock file:
21:16:56.633 INFO   tofu: │   - registry.terraform.io/hashicorp/random => registry.opentofu.org/hashicorp/random
21:16:56.633 INFO   tofu: │ 
21:16:56.633 INFO   tofu: │ The version selections were preserved, but the hashes were not because the
21:16:56.633 INFO   tofu: │ OpenTofu project's provider releases are not byte-for-byte identical.
21:16:56.633 INFO   tofu: ╵
21:16:56.633 INFO   tofu: 
21:16:56.634 INFO   tofu: OpenTofu has been successfully initialized!
21:16:56.634 INFO   tofu: 
21:16:56.634 INFO   tofu: You may now begin working with OpenTofu. Try running "tofu plan" to see
21:16:56.634 INFO   tofu: any changes that are required for your infrastructure. All OpenTofu commands
21:16:56.634 INFO   tofu: should now work.
21:16:56.634 INFO   tofu: If you ever set or change modules or backend configuration for OpenTofu,
21:16:56.634 INFO   tofu: rerun this command to reinitialize your working directory. If you forget, other
21:16:56.634 INFO   tofu: commands will detect it and remind you to do so if necessary.
21:16:56.764 STDOUT tofu: OpenTofu used the selected providers to generate the following execution
21:16:56.764 STDOUT tofu: plan. Resource actions are indicated with the following symbols:
21:16:56.764 STDOUT tofu:   + create
21:16:56.764 STDOUT tofu: OpenTofu will perform the following actions:
21:16:56.765 STDOUT tofu:   # random_string.base_bucket_name will be created
21:16:56.765 STDOUT tofu:   + resource "random_string" "base_bucket_name" {
21:16:56.765 STDOUT tofu:       + id          = (known after apply)
21:16:56.765 STDOUT tofu:       + length      = 4
21:16:56.765 STDOUT tofu:       + lower       = true
21:16:56.765 STDOUT tofu:       + min_lower   = 0
21:16:56.765 STDOUT tofu:       + min_numeric = 0
21:16:56.765 STDOUT tofu:       + min_special = 0
21:16:56.765 STDOUT tofu:       + min_upper   = 0
21:16:56.765 STDOUT tofu:       + number      = false
21:16:56.765 STDOUT tofu:       + numeric     = false
21:16:56.765 STDOUT tofu:       + result      = (known after apply)
21:16:56.765 STDOUT tofu:       + special     = false
21:16:56.765 STDOUT tofu:       + upper       = true
21:16:56.765 STDOUT tofu:     }
21:16:56.765 STDOUT tofu: Plan: 1 to add, 0 to change, 0 to destroy.
21:16:56.765 STDOUT tofu: 
21:16:56.765 STDOUT tofu: Changes to Outputs:
21:16:56.765 STDOUT tofu:   + base_bucket_name = (known after apply)
21:16:56.798 STDOUT tofu: random_string.base_bucket_name: Creating...
21:16:56.801 STDOUT tofu: random_string.base_bucket_name: Creation complete after 0s [id=YVkt]
21:16:56.809 STDOUT tofu: 
21:16:56.809 STDOUT tofu: Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
21:16:56.809 STDOUT tofu: 
21:16:56.809 STDOUT tofu: Outputs:
21:16:56.809 STDOUT tofu: base_bucket_name = "YVkt"
21:16:56.855 INFO   [app1] Downloading Terraform configurations from ./modules/s3-bucket into ./app1/.terragrunt-cache/FdBf2LvD_Zlvqi0XwQqfyRw0RxU/gbThO4ZiNUt-131WPgDdf99WEQA
21:16:56.855 INFO   [app2] Downloading Terraform configurations from ./modules/s3-bucket into ./app2/.terragrunt-cache/zzcz-Tr6GrdCUq9Hq19O5c5X-2s/gbThO4ZiNUt-131WPgDdf99WEQA
21:16:56.876 INFO   [app1] tofu: Initializing the backend...
21:16:56.877 INFO   [app2] tofu: Initializing the backend...
21:16:56.877 INFO   [app1] tofu: Initializing provider plugins...
21:16:56.877 INFO   [app1] tofu: - Finding hashicorp/aws versions matching "~> 5.0"...
21:16:56.878 INFO   [app2] tofu: Initializing provider plugins...
21:16:56.878 INFO   [app2] tofu: - Finding hashicorp/aws versions matching "~> 5.0"...
21:16:57.453 INFO   [app1] tofu: - Installing hashicorp/aws v5.100.0...
21:16:57.453 INFO   [app2] tofu: - Installing hashicorp/aws v5.100.0...
21:18:15.056 INFO   [app1] tofu: - Installed hashicorp/aws v5.100.0 (signed, key ID 0C0AF313E5FD9F80)
21:18:15.056 INFO   [app1] tofu: Providers are signed by their developers.
21:18:15.056 INFO   [app1] tofu: If you'd like to know more about provider signing, you can read about it here:
21:18:15.056 INFO   [app1] tofu: https://opentofu.org/docs/cli/plugins/signing/
21:18:15.056 INFO   [app1] tofu: OpenTofu has created a lock file .terraform.lock.hcl to record the provider
21:18:15.056 INFO   [app1] tofu: selections it made above. Include this file in your version control repository
21:18:15.056 INFO   [app1] tofu: so that OpenTofu can guarantee to make the same selections by default when
21:18:15.056 INFO   [app1] tofu: you run "tofu init" in the future.
21:18:15.056 INFO   [app1] tofu: OpenTofu has been successfully initialized!
21:18:15.056 INFO   [app1] tofu: 
21:18:15.057 INFO   [app1] tofu: You may now begin working with OpenTofu. Try running "tofu plan" to see
21:18:15.057 INFO   [app1] tofu: any changes that are required for your infrastructure. All OpenTofu commands
21:18:15.057 INFO   [app1] tofu: should now work.
21:18:15.057 INFO   [app1] tofu: If you ever set or change modules or backend configuration for OpenTofu,
21:18:15.057 INFO   [app1] tofu: rerun this command to reinitialize your working directory. If you forget, other
21:18:15.057 INFO   [app1] tofu: commands will detect it and remind you to do so if necessary.
21:18:18.179 INFO   [app2] tofu: - Installed hashicorp/aws v5.100.0 (signed, key ID 0C0AF313E5FD9F80)
21:18:18.179 INFO   [app2] tofu: Providers are signed by their developers.
21:18:18.179 INFO   [app2] tofu: If you'd like to know more about provider signing, you can read about it here:
21:18:18.179 INFO   [app2] tofu: https://opentofu.org/docs/cli/plugins/signing/
21:18:18.179 INFO   [app2] tofu: OpenTofu has created a lock file .terraform.lock.hcl to record the provider
21:18:18.180 INFO   [app2] tofu: selections it made above. Include this file in your version control repository
21:18:18.180 INFO   [app2] tofu: so that OpenTofu can guarantee to make the same selections by default when
21:18:18.180 INFO   [app2] tofu: you run "tofu init" in the future.
21:18:18.180 INFO   [app2] tofu: OpenTofu has been successfully initialized!
21:18:18.180 INFO   [app2] tofu: 
21:18:18.180 INFO   [app2] tofu: You may now begin working with OpenTofu. Try running "tofu plan" to see
21:18:18.180 INFO   [app2] tofu: any changes that are required for your infrastructure. All OpenTofu commands
21:18:18.181 INFO   [app2] tofu: should now work.
21:18:18.181 INFO   [app2] tofu: If you ever set or change modules or backend configuration for OpenTofu,
21:18:18.181 INFO   [app2] tofu: rerun this command to reinitialize your working directory. If you forget, other
21:18:18.181 INFO   [app2] tofu: commands will detect it and remind you to do so if necessary.
21:18:19.033 STDOUT [app1] tofu: OpenTofu used the selected providers to generate the following execution
21:18:19.033 STDOUT [app1] tofu: plan. Resource actions are indicated with the following symbols:
21:18:19.033 STDOUT [app1] tofu:   + create
21:18:19.033 STDOUT [app1] tofu: OpenTofu will perform the following actions:
21:18:19.033 STDOUT [app1] tofu:   # aws_s3_bucket.this will be created
21:18:19.033 STDOUT [app1] tofu:   + resource "aws_s3_bucket" "this" {
21:18:19.033 STDOUT [app1] tofu:       + acceleration_status         = (known after apply)
21:18:19.033 STDOUT [app1] tofu:       + acl                         = "private"
21:18:19.033 STDOUT [app1] tofu:       + arn                         = (known after apply)
21:18:19.033 STDOUT [app1] tofu:       + bucket                      = "app1-new9-dev-YVkt"
21:18:19.034 STDOUT [app1] tofu:       + bucket_domain_name          = (known after apply)
21:18:19.034 STDOUT [app1] tofu:       + bucket_prefix               = (known after apply)
21:18:19.034 STDOUT [app1] tofu:       + bucket_regional_domain_name = (known after apply)
21:18:19.034 STDOUT [app1] tofu:       + force_destroy               = false
21:18:19.034 STDOUT [app1] tofu:       + hosted_zone_id              = (known after apply)
21:18:19.034 STDOUT [app1] tofu:       + id                          = (known after apply)
21:18:19.034 STDOUT [app1] tofu:       + object_lock_enabled         = (known after apply)
21:18:19.034 STDOUT [app1] tofu:       + policy                      = (known after apply)
21:18:19.034 STDOUT [app1] tofu:       + region                      = (known after apply)
21:18:19.034 STDOUT [app1] tofu:       + request_payer               = (known after apply)
21:18:19.034 STDOUT [app1] tofu:       + tags_all                    = (known after apply)
21:18:19.034 STDOUT [app1] tofu:       + website_domain              = (known after apply)
21:18:19.034 STDOUT [app1] tofu:       + website_endpoint            = (known after apply)
21:18:19.034 STDOUT [app1] tofu:       + cors_rule (known after apply)
21:18:19.034 STDOUT [app1] tofu:       + grant (known after apply)
21:18:19.034 STDOUT [app1] tofu:       + lifecycle_rule (known after apply)
21:18:19.034 STDOUT [app1] tofu:       + logging (known after apply)
21:18:19.034 STDOUT [app1] tofu:       + object_lock_configuration (known after apply)
21:18:19.034 STDOUT [app1] tofu:       + replication_configuration (known after apply)
21:18:19.034 STDOUT [app1] tofu:       + server_side_encryption_configuration (known after apply)
21:18:19.034 STDOUT [app1] tofu:       + versioning (known after apply)
21:18:19.034 STDOUT [app1] tofu:       + website (known after apply)
21:18:19.034 STDOUT [app1] tofu:     }
21:18:19.034 STDOUT [app1] tofu: Plan: 1 to add, 0 to change, 0 to destroy.
21:18:19.034 STDOUT [app1] tofu: 
21:18:19.034 STDOUT [app1] tofu: Changes to Outputs:
21:18:19.034 STDOUT [app1] tofu:   + bucket_arn = (known after apply)
21:18:20.028 STDOUT [app1] tofu: aws_s3_bucket.this: Creating...
21:18:20.640 STDOUT [app1] tofu: ╷
21:18:20.640 STDOUT [app1] tofu: │ Warning: Argument is deprecated
21:18:20.640 STDOUT [app1] tofu: │ 
21:18:20.640 STDOUT [app1] tofu: │   with aws_s3_bucket.this,
21:18:20.640 STDOUT [app1] tofu: │   on bucket.tf line 17, in resource "aws_s3_bucket" "this":
21:18:20.640 STDOUT [app1] tofu: │   17:   acl    = "private"
21:18:20.640 STDOUT [app1] tofu: │ 
21:18:20.640 STDOUT [app1] tofu: │ acl is deprecated. Use the aws_s3_bucket_acl resource instead.
21:18:20.640 STDOUT [app1] tofu: │ 
21:18:20.640 STDOUT [app1] tofu: │ (and 2 more similar warnings elsewhere)
21:18:20.640 STDERR [app1] tofu: ╷
21:18:20.640 STDOUT [app1] tofu: ╵
21:18:20.641 STDERR [app1] tofu: │ Error: creating S3 Bucket (app1-new9-dev-YVkt): operation error S3: CreateBucket, https response error StatusCode: 400, RequestID: Q361YTN1627W525K, HostID: hFOPS970eib/iTxE3BTkUl10q8+zlASCwxdZdrth6YlqE+YdIQXnABcqmdiAjEbpy8+7MC3VfFY=, api error InvalidBucketName: The specified bucket is not valid.
21:18:20.641 STDERR [app1] tofu: │ 
21:18:20.641 STDERR [app1] tofu: │   with aws_s3_bucket.this,
21:18:20.641 STDERR [app1] tofu: │   on bucket.tf line 15, in resource "aws_s3_bucket" "this":
21:18:20.641 STDERR [app1] tofu: │   15: resource "aws_s3_bucket" "this" {
21:18:20.641 STDERR [app1] tofu: │ 
21:18:20.641 STDERR [app1] tofu: ╵
21:18:20.657 ERROR  [app1] tofu invocation failed in ./app1/.terragrunt-cache/FdBf2LvD_Zlvqi0XwQqfyRw0RxU/gbThO4ZiNUt-131WPgDdf99WEQA
21:18:20.657 ERROR  [app1] Unit ./app1 has finished with an error
21:18:21.241 STDOUT [app2] tofu: OpenTofu used the selected providers to generate the following execution
21:18:21.241 STDOUT [app2] tofu: plan. Resource actions are indicated with the following symbols:
21:18:21.241 STDOUT [app2] tofu:   + create
21:18:21.241 STDOUT [app2] tofu: OpenTofu will perform the following actions:
21:18:21.241 STDOUT [app2] tofu:   # aws_s3_bucket.this will be created
21:18:21.241 STDOUT [app2] tofu:   + resource "aws_s3_bucket" "this" {
21:18:21.241 STDOUT [app2] tofu:       + acceleration_status         = (known after apply)
21:18:21.241 STDOUT [app2] tofu:       + acl                         = "private"
21:18:21.241 STDOUT [app2] tofu:       + arn                         = (known after apply)
21:18:21.241 STDOUT [app2] tofu:       + bucket                      = "app2-dev-YVkt"
21:18:21.241 STDOUT [app2] tofu:       + bucket_domain_name          = (known after apply)
21:18:21.241 STDOUT [app2] tofu:       + bucket_prefix               = (known after apply)
21:18:21.241 STDOUT [app2] tofu:       + bucket_regional_domain_name = (known after apply)
21:18:21.241 STDOUT [app2] tofu:       + force_destroy               = false
21:18:21.241 STDOUT [app2] tofu:       + hosted_zone_id              = (known after apply)
21:18:21.241 STDOUT [app2] tofu:       + id                          = (known after apply)
21:18:21.241 STDOUT [app2] tofu:       + object_lock_enabled         = (known after apply)
21:18:21.241 STDOUT [app2] tofu:       + policy                      = (known after apply)
21:18:21.241 STDOUT [app2] tofu:       + region                      = (known after apply)
21:18:21.242 STDOUT [app2] tofu:       + request_payer               = (known after apply)
21:18:21.242 STDOUT [app2] tofu:       + tags_all                    = (known after apply)
21:18:21.242 STDOUT [app2] tofu:       + website_domain              = (known after apply)
21:18:21.242 STDOUT [app2] tofu:       + website_endpoint            = (known after apply)
21:18:21.242 STDOUT [app2] tofu:       + cors_rule (known after apply)
21:18:21.242 STDOUT [app2] tofu:       + grant (known after apply)
21:18:21.242 STDOUT [app2] tofu:       + lifecycle_rule (known after apply)
21:18:21.242 STDOUT [app2] tofu:       + logging (known after apply)
21:18:21.242 STDOUT [app2] tofu:       + object_lock_configuration (known after apply)
21:18:21.242 STDOUT [app2] tofu:       + replication_configuration (known after apply)
21:18:21.242 STDOUT [app2] tofu:       + server_side_encryption_configuration (known after apply)
21:18:21.242 STDOUT [app2] tofu:       + versioning (known after apply)
21:18:21.242 STDOUT [app2] tofu:       + website (known after apply)
21:18:21.242 STDOUT [app2] tofu:     }
21:18:21.242 STDOUT [app2] tofu: Plan: 1 to add, 0 to change, 0 to destroy.
21:18:21.242 STDOUT [app2] tofu: 
21:18:21.242 STDOUT [app2] tofu: Changes to Outputs:
21:18:21.242 STDOUT [app2] tofu:   + bucket_arn = (known after apply)
21:18:22.156 STDOUT [app2] tofu: aws_s3_bucket.this: Creating...
21:18:22.711 STDOUT [app2] tofu: ╷
21:18:22.711 STDOUT [app2] tofu: │ Warning: Argument is deprecated
21:18:22.711 STDOUT [app2] tofu: │ 
21:18:22.711 STDOUT [app2] tofu: │   with aws_s3_bucket.this,
21:18:22.711 STDOUT [app2] tofu: │   on bucket.tf line 17, in resource "aws_s3_bucket" "this":
21:18:22.711 STDOUT [app2] tofu: │   17:   acl    = "private"
21:18:22.712 STDOUT [app2] tofu: │ 
21:18:22.712 STDOUT [app2] tofu: │ acl is deprecated. Use the aws_s3_bucket_acl resource instead.
21:18:22.712 STDOUT [app2] tofu: │ 
21:18:22.712 STDOUT [app2] tofu: │ (and 2 more similar warnings elsewhere)
21:18:22.712 STDOUT [app2] tofu: ╵
21:18:22.712 STDERR [app2] tofu: ╷
21:18:22.712 STDERR [app2] tofu: │ Error: creating S3 Bucket (app2-dev-YVkt): operation error S3: CreateBucket, https response error StatusCode: 400, RequestID: 35APH1FMKY22GX66, HostID: 98SuGImv15CARLhUfiF9G4cStN1dw8Hehrf2Rcx1gIadkfoBze/00tvO3S+7U3li9FuEh24Z2C0=, api error InvalidBucketName: The specified bucket is not valid.
21:18:22.712 STDERR [app2] tofu: │ 
21:18:22.712 STDERR [app2] tofu: │   with aws_s3_bucket.this,
21:18:22.712 STDERR [app2] tofu: │   on bucket.tf line 15, in resource "aws_s3_bucket" "this":
21:18:22.712 STDERR [app2] tofu: │   15: resource "aws_s3_bucket" "this" {
21:18:22.712 STDERR [app2] tofu: │ 
21:18:22.712 STDERR [app2] tofu: ╵
21:18:22.727 ERROR  [app2] tofu invocation failed in ./app2/.terragrunt-cache/zzcz-Tr6GrdCUq9Hq19O5c5X-2s/gbThO4ZiNUt-131WPgDdf99WEQA
21:18:22.727 ERROR  [app2] Unit ./app2 has finished with an error
21:18:22.728 ERROR  Run failed: 3 errors occurred:

* Failed to execute "tofu apply -auto-approve -input=false" in ./app1/.terragrunt-cache/FdBf2LvD_Zlvqi0XwQqfyRw0RxU/gbThO4ZiNUt-131WPgDdf99WEQA
  ╷
  │ Error: creating S3 Bucket (app1-new9-dev-YVkt): operation error S3: CreateBucket, https response error StatusCode: 400, RequestID: Q361YTN1627W525K, HostID: hFOPS970eib/iTxE3BTkUl10q8+zlASCwxdZdrth6YlqE+YdIQXnABcqmdiAjEbpy8+7MC3VfFY=, api error InvalidBucketName: The specified bucket is not valid.
  │ 
  │   with aws_s3_bucket.this,
  │   on bucket.tf line 15, in resource "aws_s3_bucket" "this":
  │   15: resource "aws_s3_bucket" "this" {
  │ 
  ╵
  
  exit status 1

* Failed to execute "tofu apply -auto-approve -input=false" in ./app2/.terragrunt-cache/zzcz-Tr6GrdCUq9Hq19O5c5X-2s/gbThO4ZiNUt-131WPgDdf99WEQA
  ╷
  │ Error: creating S3 Bucket (app2-dev-YVkt): operation error S3: CreateBucket, https response error StatusCode: 400, RequestID: 35APH1FMKY22GX66, HostID: 98SuGImv15CARLhUfiF9G4cStN1dw8Hehrf2Rcx1gIadkfoBze/00tvO3S+7U3li9FuEh24Z2C0=, api error InvalidBucketName: The specified bucket is not valid.
  │ 
  │   with aws_s3_bucket.this,
  │   on bucket.tf line 15, in resource "aws_s3_bucket" "this":
  │   15: resource "aws_s3_bucket" "this" {
  │ 
  ╵
  
  exit status 1

* Failed to execute "tofu apply -auto-approve -input=false" in ./modules/random
  ╷
  │ Error: Required plugins are not installed
  │ 
  │ The installed provider plugins are not consistent with the packages
  │ selected in the dependency lock file:
  │   - registry.opentofu.org/hashicorp/random: there is no package for registry.opentofu.org/hashicorp/random 3.7.2 cached in .terraform/providers
  │ 
  │ OpenTofu uses external plugins to integrate with a variety of different
  │ infrastructure services. To download the plugins required for this
  │ configuration, run:
  │   tofu init
  ╵
  
  exit status 1


>>>> APPLYING WITH TERRAGRUNT <<<<

```
</details>